In [1]:
import pandas as pd
import sqlalchemy as alch

In [2]:
from getpass import getpass
password = getpass("Introduce your sql password: ")

Introduce your sql password: ········

In [3]:
dbName="sakila"
connectionData=f"mysql+pymysql://root:{password}@localhost/{dbName}"
engine = alch.create_engine(connectionData)

data = pd.read_sql_query('''select customer_id, count(rental_id) as films_rented \
from rentals_may \
group by customer_id \
order by films_rented desc;''', engine) 
data.head()

In [4]:
data = pd.read_sql_query('''select customer_id, count(rental_id) as films_rented
from rental 
where DATE_FORMAT(rental_date, '%%m') = 5
group by customer_id
order by films_rented desc''',engine)
data.head()

   customer_id  films_rented
0          197             8
1          109             7
2          506             7
3           19             6
4           53             6

In [5]:
data2 = pd.read_sql_query('''select customer_id, count(rental_id) as films_rented
from rental 
where DATE_FORMAT(rental_date, '%%m') = 6
group by customer_id
order by films_rented desc''',engine)
data2.head()

   customer_id  films_rented
0           31            11
1          454            10
2          213             9
3          267             9
4          295             9

In [6]:
concat_df = pd.concat([data,data2])

In [7]:
len(concat_df)

1110

In [8]:
new_df = data.merge(data2,on = "customer_id",how = "inner")
new_df.head()

   customer_id  films_rented_x  films_rented_y
0          197               8               8
1          109               7               5
2          506               7               5
3           19               6               3
4           53               6               5

In [9]:
new_df = new_df.rename(columns={"films_rented_x":"films_rented_may","films_rented_y":"films_rented_june"})

In [10]:
new_df.head()

   customer_id  films_rented_may  films_rented_june
0          197                 8                  8
1          109                 7                  5
2          506                 7                  5
3           19                 6                  3
4           53                 6                  5

In [11]:
new_df['balance']=new_df['films_rented_may']<new_df['films_rented_june']

In [12]:
new_df.head()

   customer_id  films_rented_may  films_rented_june  balance
0          197                 8                  8    False
1          109                 7                  5    False
2          506                 7                  5    False
3           19                 6                  3    False
4           53                 6                  5    False